In [1]:
import pandas as pd
import numpy as np
from pathlib import Path
import zipfile
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
p1 = Path.cwd() / 'back_data'
movie = pd.read_csv(p1 / 'movie.csv', index_col='movie_title')
movie.head()

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
movie_title,,,,,,,,,,,,,,,,,,,,,
Avatar,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
Pirates of the Caribbean: At World's End,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
Spectre,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
The Dark Knight Rises,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
Star Wars: Episode VII - The Force Awakens,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0

In [3]:
movie.loc[:, ['duration']].head()

                                            duration
movie_title
Avatar                                         178.0
Pirates of the Caribbean: At World's End       169.0
Spectre                                        148.0
The Dark Knight Rises                          164.0
Star Wars: Episode VII - The Force Awakens       NaN

In [19]:
mv_2hours = movie.loc[:, ['duration']].dropna().gt(120)
movie.loc[:, ['duration']][mv_2hours].dropna()

                                                  duration
movie_title
Avatar                                               178.0
Pirates of the Caribbean: At World's End             169.0
Spectre                                              148.0
The Dark Knight Rises                                164.0
John Carter                                          132.0
...                                                    ...
As It Is in Heaven                                   133.0
Intolerance: Love's Struggle Throughout the Ages     123.0
The Big Parade                                       151.0
Ordet                                                126.0
The Ridges                                           143.0

[1039 rows x 1 columns]

In [21]:
actors = movie.loc[:, ['actor_1_facebook_likes', 'actor_2_facebook_likes']].dropna()
actors.assign(compare=actors.loc[:, 'actor_1_facebook_likes'].gt(actors.loc[:, 'actor_2_facebook_likes']))

,actor_1_facebook_likes,actor_2_facebook_likes,compare
movie_title,,,
Avatar,1000.0,936.0,True
Pirates of the Caribbean: At World's End,40000.0,5000.0,True
Spectre,11000.0,393.0,True
The Dark Knight Rises,27000.0,23000.0,True
Star Wars: Episode VII - The Force Awakens,131.0,12.0,True
...,...,...,...
Signed Sealed Delivered,637.0,470.0,True
The Following,841.0,593.0,True
A Plague So Pleasant,0.0,0.0,False
Shanghai Calling,946.0,719.0,True
My Date with Drew,86.0,23.0,True

In [23]:
# and, or, not을 쓰면 객체 전체(Series 전체)의 truthiness를 찾으려고 시도 → 이치에 맞지 않고 개별 값의 True / False를 찾아야
# '&, |, ~' 등 비트별 연산자는 비교 연산자보다 우선순위가 높으므로 괄호 필요
criteria1 = movie.loc[:, 'imdb_score'] > 8
criteria2 = movie.loc[:, 'content_rating'] == 'PG-13'
criteria3 = (movie.loc[:, 'title_year'] < 2000) | (movie.loc[:, 'title_year'] > 2009)
criteria_final = criteria1 & criteria2 & criteria3
criteria_final.head()

movie_title
Avatar                                        False
Pirates of the Caribbean: At World's End      False
Spectre                                       False
The Dark Knight Rises                          True
Star Wars: Episode VII - The Force Awakens    False
dtype: bool

In [26]:
crit_a1 = movie.imdb_score > 8
crit_a2 = movie.content_rating == 'PG-13'
crit_a3 = (movie.title_year < 2000) | (movie.title_year > 2009)
final_crit_a = crit_a1 & crit_a2 & crit_a3
crit_b1 = movie.imdb_score < 5
crit_b2 = movie.content_rating == 'R'
crit_b3 = (movie.title_year >= 2000) & (movie.title_year <= 2010)
final_crit_b = crit_b1 & crit_b2 & crit_b3
final_crit_all = final_crit_a | final_crit_b
final_crit_all.head()

movie_title
Avatar                                        False
Pirates of the Caribbean: At World's End      False
Spectre                                       False
The Dark Knight Rises                          True
Star Wars: Episode VII - The Force Awakens    False
dtype: bool

In [28]:
movie.loc[final_crit_all, :].shape

(86, 27)

In [29]:
cols = ['imdb_score', 'content_rating', 'title_year']
movie_filtered = movie.loc[final_crit_all, cols]
movie_filtered.head()

                            imdb_score content_rating  title_year
movie_title
The Dark Knight Rises              8.5          PG-13      2012.0
The Avengers                       8.1          PG-13      2012.0
Captain America: Civil War         8.2          PG-13      2016.0
Guardians of the Galaxy            8.1          PG-13      2014.0
Interstellar                       8.6          PG-13      2014.0

In [31]:
college = pd.read_csv(p1 / 'college.csv')
college.head()

,INSTNM,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
0,Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,...,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
1,University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,...,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
2,Amridge University,Montgomery,AL,0.0,0.0,0.0,1,NaN,NaN,1.0,...,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370
3,University of Alabama in Huntsville,Huntsville,AL,0.0,0.0,0.0,0,595.0,590.0,0.0,...,0.0172,0.0332,0.0350,0.2146,1,0.3072,0.4596,0.2640,45500,24097
4,Alabama State University,Montgomery,AL,1.0,0.0,0.0,0,425.0,430.0,0.0,...,0.0098,0.0243,0.0137,0.0892,1,0.7347,0.7554,0.1270,26600,33118.5

In [32]:
college.loc[college['STABBR'].eq('TX'), :].head()

,INSTNM,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
3610,Abilene Christian University,Abilene,TX,0.0,0.0,0.0,1,530.0,545.0,0.0,...,0.0454,0.0423,0.0045,0.0468,1,0.2595,0.5527,0.0381,40200,25985
3611,Alvin Community College,Alvin,TX,0.0,0.0,0.0,0,NaN,NaN,0.0,...,0.0002,0.0000,0.0143,0.7123,1,0.1549,0.0625,0.2841,34500,6750
3612,Amarillo College,Amarillo,TX,0.0,0.0,0.0,0,NaN,NaN,0.0,...,0.0000,0.0001,0.0085,0.6922,1,0.3786,0.1573,0.3431,31700,10950
3613,Angelina College,Lufkin,TX,0.0,0.0,0.0,0,NaN,NaN,0.0,...,0.0264,0.0005,0.0000,0.5600,1,0.5308,0.0000,0.2603,26900,PrivacySuppressed
3614,Angelo State University,San Angelo,TX,0.0,0.0,0.0,0,475.0,490.0,0.0,...,0.0285,0.0331,0.0011,0.1289,1,0.4068,0.5279,0.1407,37700,21319.5

In [33]:
col2 = college.set_index('STABBR')
col2.loc['TX', :].head()

,INSTNM,CITY,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,UGDS,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
STABBR,,,,,,,,,,,,,,,,,,,,,
TX,Abilene Christian University,Abilene,0.0,0.0,0.0,1,530.0,545.0,0.0,3572.0,...,0.0454,0.0423,0.0045,0.0468,1,0.2595,0.5527,0.0381,40200,25985
TX,Alvin Community College,Alvin,0.0,0.0,0.0,0,NaN,NaN,0.0,4682.0,...,0.0002,0.0000,0.0143,0.7123,1,0.1549,0.0625,0.2841,34500,6750
TX,Amarillo College,Amarillo,0.0,0.0,0.0,0,NaN,NaN,0.0,9346.0,...,0.0000,0.0001,0.0085,0.6922,1,0.3786,0.1573,0.3431,31700,10950
TX,Angelina College,Lufkin,0.0,0.0,0.0,0,NaN,NaN,0.0,3825.0,...,0.0264,0.0005,0.0000,0.5600,1,0.5308,0.0000,0.2603,26900,PrivacySuppressed
TX,Angelo State University,San Angelo,0.0,0.0,0.0,0,475.0,490.0,0.0,5290.0,...,0.0285,0.0331,0.0011,0.1289,1,0.4068,0.5279,0.1407,37700,21319.5

In [39]:
states = ['TX', 'CA', 'NY']
college.loc[college['STABBR'].isin(states), :].shape, col2.loc[states, :].shape

((1704, 27), (1704, 26))

In [40]:
col3 = col2.sort_index()
col3.head()

,INSTNM,CITY,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,UGDS,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
STABBR,,,,,,,,,,,,,,,,,,,,,
AK,Charter College-Anchorage,Anchorage,0.0,0.0,0.0,0,NaN,NaN,0.0,3256.0,...,0.0436,0.0000,0.0393,0.0000,1,0.8307,0.7503,0.5472,39200,13875
AK,Alaska Career College,Anchorage,0.0,0.0,0.0,0,NaN,NaN,0.0,479.0,...,0.0334,0.0000,0.0104,0.0000,1,0.7078,0.7860,0.5612,28700,8994
AK,AVTEC-Alaska's Institute of Technology,Seward,0.0,0.0,0.0,0,NaN,NaN,0.0,889.0,...,0.0529,0.0000,0.1395,0.6817,1,0.0737,0.0664,0.7127,33500,PrivacySuppressed
AK,Alaska Pacific University,Anchorage,0.0,0.0,0.0,1,555.0,503.0,0.0,275.0,...,0.0945,0.0000,0.0873,0.3745,1,0.3152,0.5297,0.4910,47000,23250
AK,University of Alaska Southeast,Juneau,0.0,0.0,0.0,0,NaN,NaN,0.0,1428.0,...,0.0686,0.0049,0.2241,0.5112,1,0.1769,0.1996,0.5550,37400,16875

In [41]:
%%timeit
col3.loc[states, :]

378 µs ± 1.3 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [43]:
col4 = college.set_index('INSTNM').sort_index()
col4.loc[['Stanford University'], :]

,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,UGDS,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
INSTNM,,,,,,,,,,,,,,,,,,,,,
Stanford University,Stanford,CA,0.0,0.0,0.0,0,730.0,745.0,0.0,7018.0,...,0.1067,0.0819,0.0031,0.0,1,0.1556,0.1256,0.0401,86000,12782

In [44]:
college.loc[college['INSTNM'].eq('Stanford University'), :]

,INSTNM,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
4217,Stanford University,Stanford,CA,0.0,0.0,0.0,0,730.0,745.0,0.0,...,0.1067,0.0819,0.0031,0.0,1,0.1556,0.1256,0.0401,86000,12782

In [46]:
col5 = college.copy()
col5.index = col5.loc[:, 'CITY'] + ', ' + col5.loc[:, 'STABBR']
col5 = col5.sort_index()
col5.head()

,INSTNM,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
"ARTESIA, CA",Angeles Institute,ARTESIA,CA,0.0,0.0,0.0,0,NaN,NaN,0.0,...,0.0175,0.0088,0.0088,0.0000,1,0.6275,0.8138,0.5429,NaN,16850
"Aberdeen, SD",Presentation College,Aberdeen,SD,0.0,0.0,0.0,1,440.0,480.0,0.0,...,0.0284,0.0142,0.0823,0.2865,1,0.4829,0.7560,0.3097,35900,25000
"Aberdeen, SD",Northern State University,Aberdeen,SD,0.0,0.0,0.0,0,480.0,475.0,0.0,...,0.0219,0.0425,0.0024,0.1872,1,0.2272,0.4303,0.1766,33600,24847
"Aberdeen, WA",Grays Harbor College,Aberdeen,WA,0.0,0.0,0.0,0,NaN,NaN,0.0,...,0.0937,0.0009,0.0250,0.1820,1,0.4530,0.1502,0.5087,27000,11490
"Abilene, TX",Hardin-Simmons University,Abilene,TX,0.0,0.0,0.0,1,508.0,515.0,0.0,...,0.0298,0.0159,0.0102,0.0685,1,0.3256,0.5547,0.0982,38700,25864

In [47]:
col5.loc['Miami, FL', :].head()

,INSTNM,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
"Miami, FL",New Professions Technical Institute,Miami,FL,0.0,0.0,0.0,0,NaN,NaN,0.0,...,0.0000,0.0,0.0,0.4464,1,0.8701,0.6780,0.8358,18700,8682
"Miami, FL",Management Resources College,Miami,FL,0.0,0.0,0.0,0,NaN,NaN,0.0,...,0.0000,0.0,0.0,0.0000,1,0.4239,0.5458,0.8698,PrivacySuppressed,12182
"Miami, FL",Strayer University-Doral,Miami,FL,NaN,NaN,NaN,1,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN,49200,36173.5
"Miami, FL",Keiser University- Miami,Miami,FL,NaN,NaN,NaN,1,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN,29700,26063
"Miami, FL",George T Baker Aviation Technical College,Miami,FL,0.0,0.0,0.0,0,NaN,NaN,0.0,...,0.0046,0.0,0.0,0.5686,1,0.2567,0.0000,0.4366,38600,PrivacySuppressed

In [48]:
emp = pd.read_csv(p1 / 'employee.csv')
emp.head()

,UNIQUE_ID,POSITION_TITLE,DEPARTMENT,BASE_SALARY,RACE,EMPLOYMENT_TYPE,GENDER,EMPLOYMENT_STATUS,HIRE_DATE,JOB_DATE
0,0,ASSISTANT DIRECTOR (EX LVL),Municipal Courts Department,121862.0,Hispanic/Latino,Full Time,Female,Active,2006-06-12,2012-10-13
1,1,LIBRARY ASSISTANT,Library,26125.0,Hispanic/Latino,Full Time,Female,Active,2000-07-19,2010-09-18
2,2,POLICE OFFICER,Houston Police Department-HPD,45279.0,White,Full Time,Male,Active,2015-02-03,2015-02-03
3,3,ENGINEER/OPERATOR,Houston Fire Department (HFD),63166.0,White,Full Time,Male,Active,1982-02-08,1991-05-25
4,4,ELECTRICIAN,General Services Department,56347.0,White,Full Time,Male,Active,1989-06-19,1994-10-22

In [51]:
depts = ['Houston Police Department-HPD', 'Houston Fire Department (HFD)']
select = ['UNIQUE_ID', 'DEPARTMENT', 'GENDER', 'BASE_SALARY']
(emp
 .query("DEPARTMENT in @depts and GENDER == 'Female' and 80000 <= BASE_SALARY <= 120000")
 .loc[:, select]
)

      UNIQUE_ID                     DEPARTMENT  GENDER  BASE_SALARY
61           61  Houston Fire Department (HFD)  Female      96668.0
136         136  Houston Police Department-HPD  Female      81239.0
367         367  Houston Police Department-HPD  Female      86534.0
474         474  Houston Police Department-HPD  Female      91181.0
513         513  Houston Police Department-HPD  Female      81239.0
564         564  Houston Police Department-HPD  Female      81239.0
595         595  Houston Police Department-HPD  Female      99953.0
937         937  Houston Police Department-HPD  Female      81239.0
954         954  Houston Police Department-HPD  Female      91181.0
1118       1118  Houston Police Department-HPD  Female     104455.0
1519       1519  Houston Police Department-HPD  Female      91181.0
1565       1565  Houston Police Department-HPD  Female      81239.0
1622       1622  Houston Police Department-HPD  Female      91181.0

In [58]:
crit_dept = emp['DEPARTMENT'].isin(depts)
crit_gender = emp['GENDER'].eq('Female')
crit_sal = emp['BASE_SALARY'].between(80_000, 120_000, inclusive='both')
crit_final = crit_dept & crit_gender & crit_sal
emp.loc[crit_final, select]

      UNIQUE_ID                     DEPARTMENT  GENDER  BASE_SALARY
61           61  Houston Fire Department (HFD)  Female      96668.0
136         136  Houston Police Department-HPD  Female      81239.0
367         367  Houston Police Department-HPD  Female      86534.0
474         474  Houston Police Department-HPD  Female      91181.0
513         513  Houston Police Department-HPD  Female      81239.0
564         564  Houston Police Department-HPD  Female      81239.0
595         595  Houston Police Department-HPD  Female      99953.0
937         937  Houston Police Department-HPD  Female      81239.0
954         954  Houston Police Department-HPD  Female      91181.0
1118       1118  Houston Police Department-HPD  Female     104455.0
1519       1519  Houston Police Department-HPD  Female      91181.0
1565       1565  Houston Police Department-HPD  Female      81239.0
1622       1622  Houston Police Department-HPD  Female      91181.0

In [59]:
top_5_depts = emp['DEPARTMENT'].value_counts().index[:5]
criteria = ~emp['DEPARTMENT'].isin(top_5_depts)
emp.loc[criteria, select]

      UNIQUE_ID                   DEPARTMENT  GENDER  BASE_SALARY
0             0  Municipal Courts Department  Female     121862.0
1             1                      Library  Female      26125.0
4             4  General Services Department    Male      56347.0
18           18  General Services Department    Male      40581.0
32           32                      Finance    Male      46963.0
...         ...                          ...     ...          ...
1976       1976       Solid Waste Management  Female      34466.0
1983       1983   Admn. & Regulatory Affairs  Female      55172.0
1985       1985  Fleet Management Department    Male      30222.0
1988       1988             Legal Department    Male     124115.0
1990       1990           Parks & Recreation  Female      30347.0

[419 rows x 4 columns]

In [60]:
(emp
 .query("DEPARTMENT not in @top_5_depts")
 .loc[:, select]
)

      UNIQUE_ID                   DEPARTMENT  GENDER  BASE_SALARY
0             0  Municipal Courts Department  Female     121862.0
1             1                      Library  Female      26125.0
4             4  General Services Department    Male      56347.0
18           18  General Services Department    Male      40581.0
32           32                      Finance    Male      46963.0
...         ...                          ...     ...          ...
1976       1976       Solid Waste Management  Female      34466.0
1983       1983   Admn. & Regulatory Affairs  Female      55172.0
1985       1985  Fleet Management Department    Male      30222.0
1988       1988             Legal Department    Male     124115.0
1990       1990           Parks & Recreation  Female      30347.0

[419 rows x 4 columns]